package ru.gb.timesheet.hw;

public class HomeWork {
    /**
     * 1.повторить все, что на семинаре
     * 2. в обьект timesheet должно подставляться текущее время на стороне сервера.
     * Т.е не клиент присылает, а сервер устанавливает.
     * 3. Создать отдельный контроллер для проектов (поле Timesheet.project)
     * 3.1 Создать класс Project с полями id, name
     * 3.2 Создать CRUD-контроллер для класса Project, сервис и репозиторий
     * 3.3 В ресурсе Timesheet поле project именить на projectId
     * 3.4 При создании Timesheet проверять, что project с идентификатором projectId существует
     *
     * * 4. Создать ресурс /projects/{id}/timesheets - загрузить таймшиты для конкретного проекта
     *
     * * * 5. Создать ресурс /timesheets?createdAtAfter=2024-07-04 - ручка для получения всех таймшитов,
     * которые указаны ПОСЛЕ указанного параматера.
     * Аналагично createdAtBefore
     */
}
